leetcode_2453_destroy_sequential_targets.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 2453. Destroy Sequential Targets</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">
</head>
<body>
<!--  --><nav><span class="nav-header">Problem Solving</span><span class="nav-items"><a href="index.html">Home</a><span></nav><div id="content" class="content">
<h1 class="title">Leetcode: 2453. Destroy Sequential Targets</h1>

<div id="outline-container-org8247d52" class="outline-2">
<h2 id="org8247d52">Understand the problem</h2>
<div class="outline-text-2" id="text-org8247d52">
<p>
Find smallest element in <a href="equivalence_group.html#ID-8BB7F857-6BCC-44AC-975B-7136D79295C3">Equivalence group</a>.
</p>
</div>
</div>

<div id="outline-container-org50b8532" class="outline-2">
<h2 id="org50b8532">Devise a plan</h2>
<div class="outline-text-2" id="text-org50b8532">
<p>
Compute all equivalence groups.  Return the smallest element on the group with greatest cardinality.
</p>
</div>

<div id="outline-container-org794de13" class="outline-3">
<h3 id="org794de13">Carry out the plan</h3>
<div class="outline-text-3" id="text-org794de13">
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">destroyTargets</span>(<span style="font-weight: bold;">self</span>, nums: List[<span style="font-weight: bold;">int</span>], space: <span style="font-weight: bold;">int</span>) -&gt; <span style="font-weight: bold;">int</span>:
        freq = defaultdict(<span style="font-weight: bold;">list</span>)
        <span style="font-weight: bold;">for</span> n <span style="font-weight: bold;">in</span> nums:
            freq[n % space].append(n)
        <span style="font-weight: bold; font-style: italic;">maxf</span> = <span style="font-weight: bold;">max</span>(<span style="font-weight: bold;">map</span>(<span style="font-weight: bold;">len</span>, freq.values()))
        <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">min</span>(<span style="font-weight: bold;">min</span>(freq[k]) <span style="font-weight: bold;">for</span> k <span style="font-weight: bold;">in</span> freq <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">len</span>(freq[k]) == maxf)
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>